import json
import os

from sqlalchemy import create_engine


class Config:
    logger_directory = os.path.join(os.path.dirname(os.path.abspath(__file__)), 'log')
    sql_url = 'mysql+pymysql://root:root@192.168.10.131:3306/tanmu_video'
    tanmu_engine = create_engine(sql_url)






#
#     # api_list = [{  # todo 先写死在配置里
#     #     'url': "https://m3u8.tiankongapi.com/api.php/provide/vod/at/xml/",
#     #     'key': 'tiankong',
#     #     'name': '天空',
#     #     'bind_id': {  # 采集id对应的数据库id
#     #         1: 1,
#     #         2: 2,
#     #         3: 3,
#     #         4: 4,
#     #         6: 6,
#     #         7: 7,
#     #         8: 8,
#     #         9: 9,
#     #         10: 10,
#     #         11: 11,
#     #         12: 12,
#     #         13: 13,
#     #         14: 14,
#     #         15: 14,
#     #         16: 16,
#     #         20: 4,
#     #         21: 11,
#     #         24: 15,
#     #         25: 16,
#     #         28: 4,
#     #         29: 4,
#     #         30: 4,
#     #         31: 4,
#     #         32: 20,
#     #         33: 3,
#     #         34: 3,
#     #         36: 3,
#     #         37: 3,
#     #         39: 3,
#     #     }
#     # }]
#
#
#
#
#
#
if __name__ == '__main__':
    a =  {1: '亚洲情色', 2: '制服师生', 12: '卡通动漫', 3: '丝袜美腿', 4: '强奸乱伦', 5: '偷拍自拍', 13: '4K岛国', 7: '中文字幕', 8: '欧美性爱', 9: '人妻熟女', 10: '无码专区'}
    result = []
    for i, name in a.items():
        pass
    #
    # tiankong_type = {1: '电影',
    #                      2: '连续剧',
    #                      3: '综艺',
    #                      4: '动漫',
    #                      6: '动作片',
    #                      7: '喜剧片', 8: '爱情片', 9: '科幻片', 10: '恐怖片', 11: '犯罪片', 12: '战争片', 13: '国产剧', 14: '香港剧', 15: '台湾剧', 16: '美国剧',
    #                      20: '动漫片',
    #                      21: '剧情片',
    #                      24: '日本剧', 25: '海外剧', 26: '韩国剧', 28: '国产动漫', 29: '日本动漫', 30: '欧美动漫', 31: '海外动漫', 32: '记录片', 33: '大陆综艺', 34: '日韩综艺', 36: '港台综艺', 37: '欧美综艺', 39: '电影解说'}

        result.append({
            'systemId': 21,
            'apiId': i,
            'apiName': name
        })
    print(json.dumps(result, ensure_ascii=False))
db_type = {
    1:"电影",
    2:"连续剧",
    3:"综艺",
    4:"动漫",
    5:"资讯",
    7:"喜剧片",
    6:"动作片",
    8:"爱情片",
    9:"科幻片",
    10:"恐怖片",
    11:"剧情片",
    12:"战争片",
    13:"国产剧",
    14:"港台剧",
    15:"日韩剧",
    16:"欧美剧",
    17:"公告",
    18:"头条",
    20:"纪录片",
    21:"其它"
}

